In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from Config import df

In [10]:
df.head()

   S1  C1  S2  C2  S3  C3  S4  C4  S5  C5  CLASS
0   1  10   1  11   1  13   1  12   1   1      9
1   2  11   2  13   2  10   2  12   2   1      9
2   3  12   3  11   3  13   3  10   3   1      9
3   4  10   4  11   4   1   4  13   4  12      9
4   4   1   4  13   4  12   4  11   4  10      9

In [4]:
# Informacion del DataFrame
print(df.info())
print('shape:', df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1025010 entries, 0 to 1025009
Data columns (total 11 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   S1      1025010 non-null  int64
 1   C1      1025010 non-null  int64
 2   S2      1025010 non-null  int64
 3   C2      1025010 non-null  int64
 4   S3      1025010 non-null  int64
 5   C3      1025010 non-null  int64
 6   S4      1025010 non-null  int64
 7   C4      1025010 non-null  int64
 8   S5      1025010 non-null  int64
 9   C5      1025010 non-null  int64
 10  CLASS   1025010 non-null  int64
dtypes: int64(11)
memory usage: 86.0 MB
None
shape: (1025010, 11)

In [5]:
df.value_counts('CLASS')

CLASS
0    513702
1    433097
2     48828
3     21634
4      3978
5      2050
6      1460
7       236
8        17
9         8
Name: count, dtype: int64